app/Controllers/SuperAdminDashboardController.php

SELECT COUNT(*) AS `numrows`
FROM `tenants`
WHERE `deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `subscriptions`
WHERE `deleted_at` IS NULL
AND `status` = 'active'
SELECT COUNT(*) AS `numrows`
FROM `subscriptions`
WHERE `deleted_at` IS NULL
AND `status` = 'expired'
SELECT COUNT(*) AS `numrows`
FROM `subscriptions`
WHERE `deleted_at` IS NULL
AND `status` = 'suspended'
SELECT COUNT(*) AS `numrows`
FROM `subscriptions`
WHERE `deleted_at` IS NULL
AND `is_demo` = 1
SELECT COUNT(*) AS `numrows`
FROM `subscription_plans`
WHERE `deleted_at` IS NULL
---
    public function index()
    {
        $db = \Config\Database::connect();

        $tenantCount = (int) $db->table('tenants')
            ->where('deleted_at', null)
            ->countAllResults();

        $activeSubscriptions = (int) $db->table('subscriptions')
            ->where('deleted_at', null)
            ->where('status', 'active')
            ->countAllResults();

        $expiredSubscriptions = (int) $db->table('subscriptions')
            ->where('deleted_at', null)
            ->where('status', 'expired')
            ->countAllResults();

        $suspendedSubscriptions = (int) $db->table('subscriptions')
            ->where('deleted_at', null)
            ->where('status', 'suspended')
            ->countAllResults();

        $demoSubscriptions = (int) $db->table('subscriptions')
            ->where('deleted_at', null)
            ->where('is_demo', 1)
            ->countAllResults();

        $plans = (int) $db->table('subscription_plans')
            ->where('deleted_at', null)
            ->countAllResults();