app/Models/BranchModel.php

    public function getTenantBranches(bool $onlyActive = false): array
    {
        $builder = $this->scopedBuilder()
            ->where('branches.deleted_at IS NULL', null, false);

        if ($onlyActive) {
            $builder->where('branches.status', 1);
        }

        return $builder
            ->orderBy('branches.sort_order', 'ASC')
            ->orderBy('branches.id', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `branches`
WHERE 1 = 0
AND branches.deleted_at IS NULL
AND `branches`.`status` = 1
ORDER BY `branches`.`sort_order` ASC, `branches`.`id` ASC