app/Models/ProductModel.php

SELECT `products`.*
FROM `products`
WHERE `products`.`tenant_id` = 1
AND `products`.`id` = 1
AND products.deleted_at IS NULL
---
    public function findTenantProduct(int $tenantId, int $id): ?array
    {
        if ($tenantId <= 0 || $id <= 0) {
            return null;
        }

        return $this->builder()
            ->select('products.*')
            ->where('products.tenant_id', $tenantId)
            ->where('products.id', $id)
            ->where('products.deleted_at IS NULL', null, false)
            ->get()
            ->getRowArray() ?: null;