app/Models/SubscriptionPlanFeatureModel.php

    public function getPlanFeatures(int $planId): array
    {
        if ($planId <= 0) {
            return [];
        }

        $rows = $this->select('feature_key, is_enabled, limit_value')
            ->where('plan_id', $planId)
            ->where('deleted_at', null)
            ->findAll();
---
SELECT `feature_key`, `is_enabled`, `limit_value`
FROM `subscription_plan_features`
WHERE `plan_id` = 3
AND `deleted_at` IS NULL
AND `subscription_plan_features`.`deleted_at` IS NULL